app/api/main.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "It's from api"], ["description", "This is default description"], ["created_at", "2020-05-31 17:43:48.728802"], ["updated_at", "2020-05-31 17:43:48.728802"]]
SELECT "articles".* FROM "articles"
---
  end
  post 'article_add' do
    d_params = declared(params, include_missing: false)
    present Article.create(d_params), with: Entities::ArticleEntity
  end

  get 'articles' do
    present Article.all, with: Entities::ArticleEntity