app/controllers/articles_controller.rb

  def show
    #byebug
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @article = Article.find(params['id'])
    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "articles" SET "description" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["description", "First Aticle descripti"], ["updated_at", "2020-06-02 06:39:58.062817"], ["id", 1]]

  def set_article
    @article = Article.find(params['id'])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]